{
  "analysis_summary": "The model produced a slate-level summary and top plays for an 8-game slate with 329 eligible lines. Top recommended 'LEAN' plays concentrate on IND @ BKN props (Jay Huff and Kam Jones) and a WAS @ CLE prop (Jarrett Allen). Key model design notes: it uses market-implied fair probabilities adjusted for injury/roster/opponent factors, deterministic minutes/usage projections (v0), and deterministic SGP/SGPx correlation haircuts (v0).",
  "bottom_line": "The deterministic model offers specific actionable 'LEAN' prop recommendations and clearly states its methodological limits (deterministic minutes/usage and correlation rules). External box-score evidence partially challenges the Allen OVER 28.5 PRA ticket (recent 22/13) while showing Huff has upside (career-high 29) but also variability. Evidence quality is limited to a few recent game reports, so confidence in model edges depends on how well deterministic assumptions capture real variance.",
  "refuting_facts": [
    {
      "fact": "Recent game recaps and box scores show Jarrett Allen logged a 22/13 double-double in a Cavaliers game, which is lower than the model's suggested OVER 28.5 points+rebounds+assists ticket.",
      "source_title": "CBSSports recap: Cavaliers Jarrett Allen double-double",
      "source_url": "https://www.cbssports.com/fantasy/basketball/news/cavaliers-jarrett-allen-logs-2213-double-double/"
    },
    {
      "fact": "Jay Huff has recorded a career-high 29 points in at least one recent Pacers game, indicating volatility around his point totals relative to the model's Jay Huff OVER 13.5 points play.",
      "source_title": "CBSSports: Pacers Jay Huff nets career-high 29 points",
      "source_url": "https://www.cbssports.com/fantasy/basketball/news/pacers-jay-huff-nets-career-high-29-points-in-win/"
    }
  ],
  "supporting_facts": [
    {
      "fact": "Top model recommendations include Jay Huff OVER 13.5 points (FanDuel) and multiple Kam Jones props in IND @ BKN, plus Jarrett Allen OVER 28.5 points+rebounds+assists in WAS @ CLE.",
      "source_title": "Deterministic model snapshot (top_plays)",
      "source_url": "daily-20260211T230026Z"
    },
    {
      "fact": "The slate summary reports 8 games, 497 candidate lines, and 329 eligible plays after gating.",
      "source_title": "Deterministic model slate_summary",
      "source_url": "daily-20260211T230026Z"
    },
    {
      "fact": "Model uses market-implied fair probabilities with injury/roster/opponent adjustments and deterministic v0 rules for minutes/usage and SGP/SGPx correlation haircuts.",
      "source_title": "Deterministic model gaps and methodology",
      "source_url": "daily-20260211T230026Z"
    }
  ]
}
